---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooFarAway
source: html/bd99be6a-646b-59c3-c69b-75f8b4d0b34a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SiteImportFailures.TooFarAway Property

Imported Toposolid Points are located a large distance from the model and might not display properly. Points will be centered on the model instead.

## Syntax (C#)
```csharp
public static FailureDefinitionId TooFarAway { get; }
```